In [1]:
people = {
    "Name": ["Arsalan", "Farhan", "Adnan"],
    "Hobby": ["Coding", "Cycling", "Marketing"],
    "Email": ["arsalan1234@hotmail.com", "farhan124423@yahoo.com", "adnan23434@gmail.com"]
}

import pandas as pd

df = pd.DataFrame(people)

In [3]:
df

      Name      Hobby                    Email
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com

In [4]:
df["Name"] + df["Hobby"]

0     ArsalanCoding
1     FarhanCycling
2    AdnanMarketing
dtype: object

In [7]:
df["Adding_Columns"] = df["Name"] + df["Hobby"] # adding two columns

In [8]:
df

      Name      Hobby                    Email  Adding_Columns
0  Arsalan     Coding  arsalan1234@hotmail.com   ArsalanCoding
1   Farhan    Cycling   farhan124423@yahoo.com   FarhanCycling
2    Adnan  Marketing     adnan23434@gmail.com  AdnanMarketing

In [9]:
df.drop(columns = ["Adding_Columns"], inplace = True) # remove columns

In [10]:
df

      Name      Hobby                    Email
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com

In [26]:
df[["Email", "Orginization"]] = df["Email"].str.split("@", expand=True) # splitting a words after @ but will remove @

In [27]:
df

      Name      Hobby         Email Orginization
0  Arsalan     Coding   arsalan1234  hotmail.com
1   Farhan    Cycling  farhan124423    yahoo.com
2    Adnan  Marketing    adnan23434    gmail.com

In [28]:
df["Email"] = df["Email"] + "@" + df["Orginization"] # adding two columns again

In [29]:
df

      Name      Hobby                    Email Orginization
0  Arsalan     Coding  arsalan1234@hotmail.com  hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com    yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com    gmail.com

In [30]:
df.drop(columns = ["Orginization"], inplace = True) # remove columns

In [31]:
df

      Name      Hobby                    Email
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com

In [33]:
df.append({"Name": "John"}, ignore_index = True) #Adding rows

      Name      Hobby                    Email
0  Arsalan     Coding  arsalan1234@hotmail.com
1   Farhan    Cycling   farhan124423@yahoo.com
2    Adnan  Marketing     adnan23434@gmail.com
3     John        NaN                      NaN

In [38]:
people2 = {
    "Name": ["Alexa", "Google", "Microsoft"],
    "Hobby": ["Artificial Intelligence", "Searching", "Windows"],
    "Email": ["alexa578789@hotmail.com", "google456567@yahoo.com", "microsoft7654@gmail.com"]
}

df2 = pd.DataFrame(people2)

df2

        Name                    Hobby                    Email
0      Alexa  Artificial Intelligence  alexa578789@hotmail.com
1     Google                Searching   google456567@yahoo.com
2  Microsoft                  Windows  microsoft7654@gmail.com

In [39]:
df = df.append(df2, ignore_index = True) #added the second table rows with the first table rows

        Name                    Hobby                    Email
0    Arsalan                   Coding  arsalan1234@hotmail.com
1     Farhan                  Cycling   farhan124423@yahoo.com
2      Adnan                Marketing     adnan23434@gmail.com
3      Alexa  Artificial Intelligence  alexa578789@hotmail.com
4     Google                Searching   google456567@yahoo.com
5  Microsoft                  Windows  microsoft7654@gmail.com

In [50]:
df

        Name                    Hobby                    Email
0    Arsalan                   Coding  arsalan1234@hotmail.com
1     Farhan                  Cycling   farhan124423@yahoo.com
2      Adnan                Marketing     adnan23434@gmail.com
3      Alexa  Artificial Intelligence  alexa578789@hotmail.com
4     Google                Searching   google456567@yahoo.com
5  Microsoft                  Windows  microsoft7654@gmail.com

In [53]:
df.drop(index = 4, inplace = True) # removing rows

In [54]:
df

        Name                    Hobby                    Email
0    Arsalan                   Coding  arsalan1234@hotmail.com
1     Farhan                  Cycling   farhan124423@yahoo.com
2      Adnan                Marketing     adnan23434@gmail.com
3      Alexa  Artificial Intelligence  alexa578789@hotmail.com
5  Microsoft                  Windows  microsoft7654@gmail.com

In [56]:
df.drop(index = df[df["Hobby"] == "Cycling"].index)

        Name                    Hobby                    Email
0    Arsalan                   Coding  arsalan1234@hotmail.com
2      Adnan                Marketing     adnan23434@gmail.com
3      Alexa  Artificial Intelligence  alexa578789@hotmail.com
5  Microsoft                  Windows  microsoft7654@gmail.com